In [1]:
import pandas as pd

In [2]:
people = {
    "name":['alif','john','jane'],
    'Last':['Kamate','Doe','Doe'],
    'Age':[21,22,21],
    'Email':["alif@gmail.com",'john@gmail.com','jane@gmail.com'],
    'Sex' :['male','male','female']
}

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   name    Last  Age           Email     Sex
0  alif  Kamate   21  alif@gmail.com    male
1  john     Doe   22  john@gmail.com    male
2  jane     Doe   21  jane@gmail.com  female

## from the <kbd>Pandas </kbd> docs

In [8]:
age_sex = df[['Age','Sex']]
age_sex

   Age     Sex
0   21    male
1   22    male
2   21  female

## how do i filter specific rows froma <kbd>DataFrame</kbd>

In [9]:
above_35 = df[df['Age'] > 21]
above_35

   name Last  Age           Email   Sex
1  john  Doe   22  john@gmail.com  male

## from corey schafer

In [10]:
df['Last'] == 'Doe'

0    False
1     True
2     True
Name: Last, dtype: bool

In [16]:
# filt = (df['Last'] == 'Doe')
df[df['Last'] == 'Doe'] # this is also valid

   name Last  Age           Email     Sex
1  john  Doe   22  john@gmail.com    male
2  jane  Doe   21  jane@gmail.com  female

In [17]:
df[filt]

   name Last  Age           Email     Sex
1  john  Doe   22  john@gmail.com    male
2  jane  Doe   21  jane@gmail.com  female

In [20]:
df.loc[filt] # here filt is a variable which we are selecting from above not a df columns

   name Last  Age           Email     Sex
1  john  Doe   22  john@gmail.com    male
2  jane  Doe   21  jane@gmail.com  female

In [22]:
df.loc[filt,'Email'] # .loc[rows,columns]

1    john@gmail.com
2    jane@gmail.com
Name: Email, dtype: object